src/performance/artilleryTest.yml
config:
  target: "https://jsonplaceholder.typicode.com" # Replace with your actual API endpoint
  phases:
    - duration: 20
      arrivalRate: 40 # Number of virtual users per second

scenarios:
  - flow:
      - get:
          url: "/todos/1" # Replace with your actual API endpoint
      - post:
          url: '/posts'  # Replace with your actual API endpoint
          json:
            key: 'value'  # Replace with actual request body
      # - put:
      #     url: '/api/v1/resource/1'  # Replace with your actual API endpoint
      #     json:
      #       key: 'updatedValue'  # Replace with actual request body
      # - delete:
      #     url: '/api/v1/resource/1'  # Replace with your actual API endpoint